app/controllers/books_controller.rb

  def index
    if flash[:search_result].nil?
      @books = Book.all
---
SELECT "books".* FROM "books"